// arabic statements
export const ANNOUNCEMENT = "إعلان هام 📢";
export const NOTICE = "📌ملاحظة: ";
export const BEST_WISHES = "مع تمنياتي بالتوفيق للجميع،";
export const MENU = "القائمة";
export const NAME_TEST = "أحمد ثروت رفاعي";
export const STUDENTS_ITEMS = {
  NEWS: "الأخبار المعلنة",
  ENROLLED_MATERIALS: "المواد المسجلة",
  CHAT: "الدردشة",
  DISCUSSION: "المنتدى",
  WEEKLY_SCHEDULE: "جدول أسبوعي",
  TIMELINE: "الجدول الزمني",
  EXAMS: "الاختبارات",
  TASKS: "المهام",
  STUDENT_PROGRESS: "التقدم الأكاديمي",
  FINAL_RESULTS: "النتائج النهائية",
};

export const ADMIN_PANEL_ITEMS = {
  DASHBOARD: "لوحة التحكم",
  NEWS_MANAGEMENT: "إدارة الأخبار",
  MATERIALS_MANAGEMENT: "إدارة المواد",
  QUIZZES_MANAGEMENT: "إدارة الكويزات",
  TASKS_MANAGEMENT: "إدارة التكاليف",
  STUDENTS_MANAGEMENT: "إدارة الطلاب",
  DISCUSSION_MANAGEMENT: "إدارة المنتدى",
  WEEKLY_SCHEDULE: "الجدول الأسبوعي",
  FINAL_GRADES: "الدرجات النهائية",
};
export const STUDENT_PAGES_PROPERTIES = {
  NEWS: {
    title: "آخر المنشورات",
    description:
      "📚 يرجى اختيار المواد التي تود الاطلاع على منشوراتها وآخر مستجداتها!",
  },
  ENROLLED_MATERIALS: {
    title: "المواد المسجلة",
    description:
      "📋 هذه هي المواد التي قمت بتسجيلها، يمكنك معرفة تقدمك والوصول الي محتوي كل مادة!",
  },
  MATERIAL: {
    title: "مادة/",
    description: `🎓📚 كل اللي محتاجه لمادتك في مكان واحد: محاضرات، سكاشن، اسايمنتات، كويزات، فيديوهات، ميدتيرم، وامتحانات نهائية!`,
  },
  CHAT: {
    title: "الدردشة",
    description:
      "💬 مرحباً في الدردشة الجماعية! تواصل مع زملائك واسأل أسئلتك، وشارك أفكارك حول المواد الدراسية هنا!",
  },
  DISCUSSION: {
    title: "المنتدى",
    description:
      "💬 مرحباً بك في منتدى الأسئلة والإجابات!  اطرح أسئلتك، وشارك معرفتك بالإجابة على أسئلة الآخرين، واستفد من خبرات زملائك هنا!",
  },

  DISCUSSION_ANSWERS: {
    title: "الإجابات",
    description:
      "💬 مرحباً بك في منتدى الأسئلة والإجابات!  اطرح أسئلتك، وشارك معرفتك بالإجابة على أسئلة الآخرين، واستفد من خبرات زملائك هنا!",
  },

  WEEKLY_SCHEDULE: {
    title: "الجدول الاسبوعي",
    description: `هنا يمكنك استعراض جميع الإجابات المقدمة لسؤالك. اقرأ آراء زملائك واقتراحاتهم، واطرح أسئلتك الإضافية إذا كنت بحاجة إلى توضيح.`,
  },
  TIMELINE: {
    title: "الجدول الزمني",
    description: `📅 مرحباً بك في صفحة الجدول الزمني للكويزات والتكاليف! 
هنا يمكنك الاطلاع على مواعيد الكويزات القادمة وتسليم التكاليف لكل مادة. تأكد من مراجعة الجدول بانتظام حتى لا تفوتك أي مهام أو اختبارات مهمة. ⏰`,
  },
  EXAMS: {
    title: "الإختبارات",
    description: `📝 أهلاً بك في صفحة الكويزات! 
 🚀 اختر المادة وابدأ بالأسئلة لتحقق تقدمك وتتعرف على نقاط قوتك وتلك التي تحتاج تطويرها.`,
  },
  MATERIAL_EXAM: {
    title: "إختبار مادة/",
    description: `📋  اختبر معلوماتك، واستعد للامتحان من خلال الإجابة على الأسئلة المخصصة!`,
  },
  TASKS: {
    title: "المهام",
    description: `📝 أهلاً بك في صفحة التكاليف! 
هنا تجد جميع المهام لكل مادة،. تأكد من متابعة تقدمك وإدارة وقتك بشكل جيد لإتمام التكاليف بنجاح. 🚀`,
  },
  MATERIAL_TASK: {
    title: "مهام مادة/",
    description: `📤 مرحباً بك في صفحة تسليم الأسايمنت! هنا يمكنك رفع ملفات المهام المطلوبة لكل مادة بسهولة. تأكد من اتباع الإرشادات الخاصة بكل أسايمنت قبل التسليم، وتحقق من تسليم العمل قبل الموعد النهائي لضمان احتساب الدرجة.`,
  },
  STUDENT_PROGRESS: {
    title: "مستوي التقدم الأكاديمي",
    description: `يرجى اختيار المواد التي تود الاطلاع على منشوراتها وآخر مستجداتها!`,
  },
  FINAL_RESULTS: {
    title: "النتائج النهائية",
    description:
      "يرجى اختيار المواد التي تود الاطلاع على منشوراتها وآخر مستجداتها!",
  },
  PROFILE: {
    title: "الملف الشخصي",
    description: `👤 مرحباً بك في صفحة البروفايل!
📝 هنا يمكنك مراجعة وتحديث معلوماتك الشخصية.`,
  },
};
export const CHAT_WELCOME =
  "👥 يمكنك الانضمام إلى المجموعة الخاصة بعامك الدراسي فقط للتواصل مع زملائك!";
