// arabic statements
export const ANNOUNCEMENT = "إعلان هام 📢";
export const NOTICE = "📌ملاحظة: ";
export const BEST_WISHES = "مع تمنياتي بالتوفيق للجميع،";
export const MENU = "القائمة";
export const NAME_TEST = "أحمد ثروت رفاعي";
export const STUDENTS_ITEMS = {
  NEWS: "الأخبار المعلنة",
  ENROLLED_MATERIALS: "المواد المسجلة",
  CHAT: "الدردشة",
  DISCUSSION: "المنتدى",
  WEEKLY_SCHEDULE: "جدول أسبوعي",
  TIMELINE: "الجدول الزمني",
  EXAMS: "الاختبارات",
  TASKS: "المهام",
  STUDENT_PROGRESS: "التقدم الأكاديمي",
  FINAL_RESULTS: "النتائج النهائية",
};
export const ADMIN_ITEMS = {
  DASHBOARD: "لوحة التحكم",
  NEWS_MANAGEMENT: "إدارة الأخبار",
  MATERIALS_MANAGEMENT: "إدارة المواد",
  QUIZZES_MANAGEMENT: "إدارة الكويزات",
  TASKS_MANAGEMENT: "إدارة التكاليف",
  STUDENTS_MANAGEMENT: "إدارة الطلاب",
  DISCUSSION_MANAGEMENT: "إدارة المنتدى",
  WEEKLY_SCHEDULE: "الجدول الأسبوعي",
  FINAL_GRADES: "الدرجات النهائية",
};

export const SUPER_ADMIN_ITEMS = {
  DASHBOARD: "لوحة التحكم",
  DEPARTMENTS_MANAGEMENT: "إدارة الأقسام",
  MATERIALS_MANAGEMENT: "إدارة المواد الدراسية",
  USERS_MANAGEMENT: "إدارة المستخدمين",
  SCHEDULES: "الجداول الدراسية",
  REPORTS: "التقارير",
  NEWS_ANNOUNCEMENTS: "الأخبار والإعلانات",
  NOTIFICATIONS: "إشعارات وتنبيهات",
};

export const STUDENT_PAGES_PROPERTIES = {
  NEWS: {
    title: "آخر المنشورات",
    description:
      "📚 يرجى اختيار المواد التي تود الاطلاع على منشوراتها وآخر مستجداتها!",
  },
  ENROLLED_MATERIALS: {
    title: "المواد المسجلة",
    description:
      "📋 هذه هي المواد التي قمت بتسجيلها، يمكنك معرفة تقدمك والوصول الي محتوي كل مادة!",
  },
  MATERIAL: {
    title: "مادة/",
    description: `🎓📚 كل اللي محتاجه لمادتك في مكان واحد: محاضرات، سكاشن، اسايمنتات، كويزات، فيديوهات، ميدتيرم، وامتحانات نهائية!`,
  },
  CHAT: {
    title: "الدردشة",
    description:
      "💬 مرحباً في الدردشة الجماعية! تواصل مع زملائك واسأل أسئلتك، وشارك أفكارك حول المواد الدراسية هنا!",
  },
  DISCUSSION: {
    title: "المنتدى",
    description:
      "💬 مرحباً بك في منتدى الأسئلة والإجابات!  اطرح أسئلتك، وشارك معرفتك بالإجابة على أسئلة الآخرين، واستفد من خبرات زملائك هنا!",
  },

  DISCUSSION_ANSWERS: {
    title: "الإجابات",
    description:
      "💬 مرحباً بك في منتدى الأسئلة والإجابات!  اطرح أسئلتك، وشارك معرفتك بالإجابة على أسئلة الآخرين، واستفد من خبرات زملائك هنا!",
  },

  WEEKLY_SCHEDULE: {
    title: "الجدول الاسبوعي",
    description: `هنا يمكنك استعراض جميع الإجابات المقدمة لسؤالك. اقرأ آراء زملائك واقتراحاتهم، واطرح أسئلتك الإضافية إذا كنت بحاجة إلى توضيح.`,
  },
  TIMELINE: {
    title: "الجدول الزمني",
    description: `📅 مرحباً بك في صفحة الجدول الزمني للكويزات والتكاليف! 
هنا يمكنك الاطلاع على مواعيد الكويزات القادمة وتسليم التكاليف لكل مادة. تأكد من مراجعة الجدول بانتظام حتى لا تفوتك أي مهام أو اختبارات مهمة. ⏰`,
  },
  EXAMS: {
    title: "الإختبارات",
    description: `📝 أهلاً بك في صفحة الكويزات! 
 🚀 اختر المادة وابدأ بالأسئلة لتحقق تقدمك وتتعرف على نقاط قوتك وتلك التي تحتاج تطويرها.`,
  },
  MATERIAL_EXAM: {
    title: "إختبارات مادة/",
    description: `📋  اختبر معلوماتك، واستعد للامتحان من خلال الإجابة على الأسئلة المخصصة!`,
  },
  EXAMINATION: {
    title: "إختبار مادة/",
  },
  TASKS: {
    title: "المهام",
    description: `📝 أهلاً بك في صفحة التكاليف! 
هنا تجد جميع المهام لكل مادة،. تأكد من متابعة تقدمك وإدارة وقتك بشكل جيد لإتمام التكاليف بنجاح. 🚀`,
  },
  MATERIAL_TASK: {
    title: "مهام مادة/",
    description: `📤 مرحباً بك في صفحة تسليم الأسايمنت! هنا يمكنك رفع ملفات المهام المطلوبة لكل مادة بسهولة. تأكد من اتباع الإرشادات الخاصة بكل أسايمنت قبل التسليم، وتحقق من تسليم العمل قبل الموعد النهائي لضمان احتساب الدرجة.`,
  },
  STUDENT_PROGRESS: {
    title: "مستوي التقدم الأكاديمي",
    description: `يرجى اختيار المواد التي تود الاطلاع على منشوراتها وآخر مستجداتها!`,
  },
  FINAL_RESULTS: {
    title: "النتائج النهائية",
    description:
      "يرجى اختيار المواد التي تود الاطلاع على منشوراتها وآخر مستجداتها!",
  },
  PROFILE: {
    title: "الملف الشخصي",
    description: `👤 مرحباً بك في صفحة البروفايل!
📝 هنا يمكنك مراجعة وتحديث معلوماتك الشخصية.`,
  },
};
export const ADMIN_PAGES_PROPERTIES = {
  DASHBOARD: {
    title: "لوحة التحكم",
    description:
      "👨‍🏫 مركز إدارة المواد الدراسية الخاصة بك بكل سهولة، من الطلاب إلى المحاضرات والكويزات!",
  },
  CURRICULUM: {
    title: "المنهج الدراسي /",
    description:
      "🎓📚 كل اللي محتاجه لمادتك📚 استعرض جميع مواد المنهج الدراسي في صفحة واحدة تشمل المحاضرات، السكاشن، الأسايمنتات، الكويزات، الفيديوهات، الميدتيرم، والامتحانات النهائية بسهولة ووضوح.",
  },
  Enrolled_STUDENTS: {
    title: "/ الطلاب المسجلين بالمادة",
    description:
      "👥 استعرض قائمة جميع الطلاب المسجلين في المادة مع تفاصيل مثل الاسم، الرقم الأكاديمي،",
  },
  NEWS_ADMIN: {
    title: "إدارة الأخبار",
    description:
      "📰 أنشئ وأدر الأخبار والإعلانات الهامة لموادك الدراسية بسهولة، وأبقى طلابك على اطلاع دائم!",
  },
  NEWS_ADD: {
    title: "إضافة خبر جديد/",
    description:
      "🆕 أضف خبرًا جديدًا لإبقاء طلابك على اطلاع دائم بكل التحديثات والمستجدات",
  },
  MATERIALS_ADMIN: {
    title: "إدارة المواد",
    description:
      "📚 تحكم كامل بموادك الدراسية، من إضافة المحاضرات إلى متابعة تقدم الطلاب وإدارة الكويزات والأسايمنتات!",
  },

  QR_ADMIN: {
    title: "إدارة المواد / تسجيل حضور 'QR'",
  },
  TIMELINE: {
    title: "الجدول الزمني",
    description: `📅 مرحباً بك في صفحة الجدول الزمني للكويزات والتكاليف! 
هنا يمكنك الاطلاع على مواعيد الكويزات القادمة وتسليم التكاليف لكل مادة. تأكد من مراجعة الجدول بانتظام حتى لا تفوتك أي مهام أو اختبارات مهمة. ⏰`,
  },
  MATERIAL_ADD: {
    title: "إدارة المواد / إضافة مواد دراسية",
    description: "📚 قم بإضافة مواد دراسية جديدة وإدارة تفاصيلها بكل سهولة!",
  },
  QUIZZES_ADMIN: {
    title: "ادارة الكويزات",
    description: "❓أنشئ، عدّل، وتابع درجات الكويزات بسهولة لضمان تقييم فعال!",
  },
  QUIZ_ADD: {
    title: "إدارة المواد / إضافة مواد دراسية",
    description: "📚 قم بإضافة مواد دراسية جديدة وإدارة تفاصيلها بكل سهولة!",
  },
  OLD_QUIZ: {
    title: "ادارة الكويزات / كويزات سابقة",
    description:
      "📜 استعرض الكويزات التي انتهت، مع إمكانية مراجعة النتائج والإجابات وتقييم الأداء.",
  },

  SCHEDULED_QUIZ: {
    title: "ادارة الكويزات / كويزات مجدولة",
    description:
      "📅 عرض قائمة بالكويزات المجدولة مع مواعيد البدء والانتهاء والإعدادات الخاصة بها.",
  },
  QUIZ_RESULTS: {
    title: "ادارة الكويزات / النتائج",
    description: "📊 استعرض نتائج الطلاب في الكويزات، بما في ذلك الدرجات!",
  },
  ASSIGNMENT_ADMIN: {
    title: "إدارة الاسايمنتات",
    description: "📝 نظم الواجبات، راجع الحلول، وقم بتحديث الدرجات بكل سهولة!",
  },
  NEW_ASSIGNMENT: {
    title: "إدارة الاسايمنتات / إنشاء أسايمنت جديد",
    description:
      "📑 قم بإنشاء أسايمنت جديد من خلال تحديد العنوان والوصف وموعد التسليم وإرفاق أي ملفات توضيحية.",
  },
  SCHEDULED_ASSIGNMENT: {
    title: "ادارة الأسايمينتات / أسايمينتات مجدولة",
    description:
      "📅 عرض قائمة الأسايمنتات القادمة مع مواعيد التسليم والحالة وإمكانية التعديل أو الإلغاء.",
  },
  OLD_ASSIGNMENT: {
    title: "ادارة الأسايمينتات / اسايمنتات سابقة",
    description:
      "📜 استعرض الأسايمنتات التي انتهت، مع إمكانية مراجعة الحلول، الدرجات، والتعليقات.",
  },
  ASSIGNMENT_RESULTS: {
    title: "ادارة الأسايمنتات / النتائج",
    description:
      "📑⚡ راجع الأسايمنتات المرسلة، قم بتقييم الإجابات، واعرض الدرجات مع إمكانية إرسال التعليقات لكل طالب.",
  },
  STUDENT_ADMIN: {
    title: "إدارة الطلاب",
    description:
      "👩‍🎓👨‍🎓 استعرض بيانات الطلاب، نسبة الحضور، ومستوى الأداء الأكاديمي.",
  },
  DISCUSSION_ADMIN: {
    title: "إدارة المنتدي",
    description:
      "💬 أشرف على الأسئلة والمناقشات، وأجب عن استفسارات الطلاب لتوفير تجربة تعليمية تفاعلية!",
  },
  WEEKLY_SCHEDULE_ADMIN: {
    title: "الجدول الأسبوعي",
    description:
      "📅 متابعة يومية للمواد والمحاضرات والمواعيد الهامة لتنظيم أفضل.",
  },
  FINAL_RESULTS_ADMIN: {
    title: "النتائج النهائية",
    description:
      "🏆 عرض ومتابعة الأداء العام للطلاب من البداية وحتى التقييم النهائي.",
  },
  PROFILE: {
    title: "الملف الشخصي",
    description: `👤 مرحباً بك في صفحة البروفايل!
📝 هنا يمكنك مراجعة وتحديث معلوماتك الشخصية.`,
  },
};
export const CHAT_WELCOME =
  "👥 يمكنك الانضمام إلى المجموعة الخاصة بعامك الدراسي فقط للتواصل مع زملائك!";
